In [ ]:
Tips dan Trik Pandas WEEK 1

In [ ]:
# 1. Membuat Suffix dan Prefix pada kolom Data Frame

In [29]:
import pandas as pd
import numpy as np
import pandas.util.testing

In [10]:
# Data Frame sederhana

a_row = 5
a_col = 5
col = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 10, size=(a_row,a_col)),columns=col)

df

   A  B  C  D  E
0  3  9  1  2  8
1  7  9  3  5  6
2  3  3  9  2  2
3  4  3  3  2  5
4  2  1  8  1  5

In [7]:
tuple('ABCDE')

('A', 'B', 'C', 'D', 'E')

In [11]:
# Menambahkan Prefix

df.add_prefix('kolom_')

   kolom_A  kolom_B  kolom_C  kolom_D  kolom_E
0        3        9        1        2        8
1        7        9        3        5        6
2        3        3        9        2        2
3        4        3        3        2        5
4        2        1        8        1        5

In [12]:
# Menambahkan Suffix

df.add_suffix('_field')

   A_field  B_field  C_field  D_field  E_field
0        3        9        1        2        8
1        7        9        3        5        6
2        3        3        9        2        2
3        4        3        3        2        5
4        2        1        8        1        5

In [ ]:
# 2. Pemilihan baris pada Data Frame

In [14]:
# Selection dengan opeator logika | (OR)

df[(df['A'] == 1) | (df['A'] == 3)]

   A  B  C  D  E
0  3  9  1  2  8
2  3  3  9  2  2

In [15]:
# Selection dengan fungsi isin()

df[df['A'].isin([1,3])]

   A  B  C  D  E
0  3  9  1  2  8
2  3  3  9  2  2

In [16]:
# Mengenal operator negasi ~

df[~df['A'].isin([1,3])]

   A  B  C  D  E
1  7  9  3  5  6
3  4  3  3  2  5
4  2  1  8  1  5

In [ ]:
# 3 Konversi tipe data String ke Numerik pada kolom Data Frame

In [18]:
# Data Frame Sederhana 

data = {'col1':['1','2','3','teks'],
       'col2':['1','2','3','4']}

df = pd.DataFrame(data)

df

   col1 col2
0     1    1
1     2    2
2     3    3
3  teks    4

In [19]:
df.dtypes

col1    object
col2    object
dtype: object

In [23]:
# Konversi tipe data denga fungsi astye()

df_x = df.astype({'col2':'int'})
df_x

   col1  col2
0     1     1
1     2     2
2     3     3
3  teks     4

In [24]:
df_x.dtypes

col1    object
col2     int32
dtype: object

In [25]:
df.apply(pd.to_numeric,errors='coerce')

   col1  col2
0   1.0     1
1   2.0     2
2   3.0     3
3   NaN     4

In [ ]:
# 4 Pemilihan kolom (columns selection) pada Data Frame berdasarkan tipe data

In [31]:
# Data Frame Sederhana

a_row = 5
a_col = 2
col = ['bil_pecahan','bil_bulat']

df = pd.DataFrame(np.random.randint(1, 20, size=(a_row, a_col)),
                 columns=col)
df['bil_pecahan'] = df['bil_pecahan'].astype('float')

df.index = pd.util.testing.makeDateIndex(a_row, freq='H')
df = df.reset_index()

df['teks'] = list('ABCDE')

df

                index  bil_pecahan  bil_bulat teks
0 2000-01-01 00:00:00         15.0          1    A
1 2000-01-01 01:00:00         11.0         19    B
2 2000-01-01 02:00:00          7.0         18    C
3 2000-01-01 03:00:00          8.0         16    D
4 2000-01-01 04:00:00         11.0         19    E

In [32]:
df.dtypes

index          datetime64[ns]
bil_pecahan           float64
bil_bulat               int32
teks                   object
dtype: object

In [33]:
# Memilih bertipe data numerik

df.select_dtypes(include='number')

   bil_pecahan  bil_bulat
0         15.0          1
1         11.0         19
2          7.0         18
3          8.0         16
4         11.0         19

In [34]:
df.select_dtypes(include='float')

   bil_pecahan
0         15.0
1         11.0
2          7.0
3          8.0
4         11.0

In [35]:
#Memilih kolom bertipe data string atau object

df.select_dtypes(include='object')

  teks
0    A
1    B
2    C
3    D
4    E

In [36]:
#Memilih kolom bertipe data date time

df.select_dtypes(include='datetime')

                index
0 2000-01-01 00:00:00
1 2000-01-01 01:00:00
2 2000-01-01 02:00:00
3 2000-01-01 03:00:00
4 2000-01-01 04:00:00

In [37]:
#Memilih kolom dengan kombinasi tipe data

df.select_dtypes(include=['datetime','object'])

                index teks
0 2000-01-01 00:00:00    A
1 2000-01-01 01:00:00    B
2 2000-01-01 02:00:00    C
3 2000-01-01 03:00:00    D
4 2000-01-01 04:00:00    E